; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	spectrograph2 - mode
	infrared3 - mode
	image1 - mode
	spectrograph0 - mode
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star3 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image1)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument6 infrared3)
	(supports instrument6 image1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star5)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet12)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite4 Phenomenon6)
	(have_image Phenomenon6 spectrograph0)
	(have_image Star7 spectrograph2)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 spectrograph2)
	(have_image Star10 spectrograph2)
	(have_image Planet11 image1)
	(have_image Planet12 spectrograph0)
	(have_image Star13 spectrograph2)
	(have_image Star14 spectrograph2)
	(have_image Planet15 image1)
))

)

; plan
1. (turn_to satellite0 star0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star0)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 planet15 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet15)
   goals met: 0 of 12
5. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 12
6. (turn_to satellite0 planet12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet12)
   goals met: 1 of 12
7. (take_image satellite0 planet12 instrument0 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 2 of 12
8. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 12
9. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon9 instrument0 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon6 instrument0 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 5 of 12
14. (turn_to satellite0 star13 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star13)
   goals met: 5 of 12
15. (take_image satellite0 star13 instrument0 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 6 of 12
16. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 12
17. (take_image satellite0 star14 instrument0 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 7 of 12
18. (turn_to satellite0 star7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star7)
   goals met: 7 of 12
19. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 8 of 12
20. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 8 of 12
21. (take_image satellite0 star8 instrument0 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 9 of 12
22. (turn_to satellite0 star10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star10)
   goals met: 10 of 12
23. (take_image satellite0 star10 instrument0 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 11 of 12
24. (turn_to satellite4 phenomenon6 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon6)
   goals met: 12 of 12
